app/views/baskets/index.html.erb

        Hi <%=current_user.username%> !<br>
      <% current_user.goals.each do |goal| %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = 1