source/app/controllers/baskets_controller.rb

  def show
    @goal = Goal.usergoals(current_user)

    if Basket.find_all_by_user_id(session[:user_id])
---
SELECT "baskets".* FROM "baskets" WHERE "baskets"."user_id" = 1 LIMIT 1