source/app/controllers/foods_controller.rb

  def create
    params["fields"]["API"]=params["_id"]
    if Food.find_by_API(params["_id"])
        @food = Food.find_by_API(params["_id"])
    else
        @food = Food.new(params["fields"])
    end
    @food.save!

    if Basket.find_by_user_id(session[:user_id])
      basket = Basket.find_by_user_id(session[:user_id])
      if BasketFood.find_by_food_id(@food.id)
        basketfood = BasketFood.find_by_food_id(@food.id)
        basketfood.quantity = basketfood.quantity + 1
        basketfood.update_attributes(quantity:  basketfood.quantity)
        basketfood.save!
      else
        BasketFood.create(basket_id: basket.id, food_id: @food.id)
---
SELECT "foods".* FROM "foods" WHERE "foods"."API" = '529e7f68ea63d49335009b02' LIMIT 1
INSERT INTO "foods" ("_id", "created_at", "item_name", "nf_protein", "nf_serving_size_qty", "nf_serving_size_unit", "nf_total_carbohydrate", "nf_total_fat", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "baskets".* FROM "baskets" WHERE "baskets"."user_id" IS NULL LIMIT 1
SELECT "basket_foods".* FROM "basket_foods" WHERE "basket_foods"."food_id" IS NULL LIMIT 1
UPDATE "basket_foods" SET "quantity" = 2 WHERE "basket_foods"."id" = 4
INSERT INTO "basket_foods" ("basket_id", "food_id", "quantity") VALUES ($1, $2, $3) RETURNING "id"  [["basket_id", 2], ["food_id", nil], ["quantity", 1]]
INSERT INTO "baskets" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 02 May 2014 23:06:20 UTC +00:00], ["updated_at", Fri, 02 May 2014 23:06:20 UTC +00:00], ["user_id", 1]]