source/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT 1
---
  def create
    @user = User.find_by_username(params[:session][:username])