source/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "goals" ("created_at", "nutrient_id", "target", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 02 May 2014 01:26:56 UTC +00:00], ["nutrient_id", 1], ["target", 5], ["updated_at", Fri, 02 May 2014 01:26:56 UTC +00:00], ["user_id", nil]]
---
  def create
    p "$" * 50
    p params
    p "$" * 50
    @user = User.new params[:user]
    @nutrients = Nutrient.all

    p @nutrients
    if @user.save!
      login_user
    end
    @goal = Goal.new params[:goal]
    @goal.user_id = @user.id
    @goal.save