app/views/home/_profile_stats.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = 2 ORDER BY "goals"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "goals" WHERE "goals"."user_id" = 2
---

<% if current_user.goals.count > 0 %>

SELECT "baskets".* FROM "baskets" WHERE "baskets"."user_id" = 2 ORDER BY "baskets"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "baskets" WHERE "baskets"."user_id" = 2
---

<% if current_user.baskets.any? %>

SELECT COUNT(*) FROM "foods" INNER JOIN "basket_foods" ON "foods"."id" = "basket_foods"."food_id" WHERE "basket_foods"."basket_id" = 9
SELECT "basket_foods".* FROM "basket_foods" WHERE "basket_foods"."basket_id" = 9
---
    <br>
     <% if current_user.baskets.last.foods.any? %>
      updated <%="#{time_ago_in_words(BasketFood.find_all_by_basket_id(current_user.baskets.last.id).last.updated_at)} ago"%>