app/controllers/basket_foods_controller.rb

  def show
    timeline_hash = {}
    #Each Basket
    xAxis = {categories: []}
    series = []
    reach_badges = []
    limit_badges = []

    last_weeks_basket = current_user.baskets.reverse[0..7]
    last_weeks_basket.each do |basket|
      xAxis[:categories].unshift(basket.created_at.strftime("%m/%d/%Y"))
    end
    # For every goal
    current_user.goals.each do |goal|
      all_days_of_week = []
      last_weeks_basket.each_with_index do |basket, index|
        today_hash = {}
        # Each food in basket
        basket.foods.each do |food|
          array_of_food = []
          item_name = Nutrient.find_by_id(goal.nutrient_id).nf_name
---
SELECT "baskets".* FROM "baskets" WHERE "baskets"."user_id" = 2
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = 2
SELECT "foods".* FROM "foods" INNER JOIN "basket_foods" ON "foods"."id" = "basket_foods"."food_id" WHERE "basket_foods"."basket_id" = 9
SELECT "nutrients".* FROM "nutrients" WHERE "nutrients"."id" = 12 LIMIT 1

      # Create User Badges
      if goal.limit == false
        if all_days_of_week.min >= goal.target
          Badge.create(user_id: current_user.id, nutrient_id:goal.nutrient.id, nutrient: goal.nutrient.name, target: goal.target, limit: goal.limit, unit: goal.unit)
---
INSERT INTO "badges" ("created_at", "goal_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 06 May 2014 22:22:46 UTC +00:00], ["goal_id", 2], ["updated_at", Tue, 06 May 2014 22:22:46 UTC +00:00], ["user_id", 2]]
SELECT "badges".* FROM "badges" WHERE "badges"."user_id" = 2 AND "badges"."goal_id" = 1 LIMIT 1

  def destroy
    @food_to_remove = BasketFood.find_by_basket_id_and_food_id(current_user.baskets.last.id, params[:id])
    @food_to_remove.destroy
---
SELECT "basket_foods".* FROM "basket_foods" WHERE "basket_foods"."basket_id" = 9 AND "basket_foods"."food_id" = 7 LIMIT 1
DELETE FROM "basket_foods" WHERE "basket_foods"."id" = $1  [["id", 82]]