app/controllers/baskets_controller.rb

SELECT "baskets".* FROM "baskets" WHERE "baskets"."user_id" IS NULL
---
  def index
    @baskets = Basket.find_all_by_user_id(session[:user_id])

SELECT "baskets".* FROM "baskets" WHERE "baskets"."user_id" = 4 LIMIT 1
---
  def show
    @goal = Goal.usergoals(current_user)
    if Basket.find_all_by_user_id(session[:user_id]).any?