app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."API" = '513fceb575b8dbbc2100108f' LIMIT 1
INSERT INTO "foods" ("API", "created_at", "item_name", "nf_calcium_dv", "nf_calories", "nf_cholesterol", "nf_dietary_fiber", "nf_ingredient_statement", "nf_iron_dv", "nf_monounsaturated_fat", "nf_polyunsaturated_fat", "nf_protein", "nf_refuse_pct", "nf_saturated_fat", "nf_serving_size_qty", "nf_serving_size_unit", "nf_serving_weight_grams", "nf_servings_per_container", "nf_sodium", "nf_sugars", "nf_total_carbohydrate", "nf_total_fat", "nf_trans_fatty_acid", "nf_vitamin_a_dv", "nf_vitamin_c_dv", "nf_water_grams", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27) RETURNING "id"
INSERT INTO "baskets" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sun, 04 May 2014 03:04:28 UTC +00:00], ["updated_at", Sun, 04 May 2014 03:04:28 UTC +00:00], ["user_id", 1]]
SELECT "baskets".* FROM "baskets" WHERE "baskets"."user_id" = 2 ORDER BY "baskets"."id" DESC LIMIT 1
SELECT "basket_foods".* FROM "basket_foods" WHERE "basket_foods"."food_id" = 7 AND "basket_foods"."basket_id" = 9 LIMIT 1
UPDATE "basket_foods" SET "quantity" = 2, "updated_at" = '2014-05-06 04:08:12.800437' WHERE "basket_foods"."id" = 2
INSERT INTO "basket_foods" ("basket_id", "created_at", "food_id", "quantity", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["basket_id", 1], ["created_at", Tue, 06 May 2014 04:07:16 UTC +00:00], ["food_id", 1], ["quantity", 1], ["updated_at", Tue, 06 May 2014 04:07:16 UTC +00:00]]
---
  def create
    params["fields"]["API"]=params["_id"]
    if Food.find_by_API(params["_id"])
      @food = Food.find_by_API(params["_id"])
    else
      @food = Food.new(params["fields"])
    end
    @food.save!

    if Basket.find_all_by_user_id(session[:user_id]).count > 0 && (Time.now-current_user.baskets.last.created_at < 80000)
      today_basket = current_user.baskets.last
      if BasketFood.find_by_food_id_and_basket_id(@food.id, today_basket.id) != nil
        basketfood = BasketFood.find_by_food_id_and_basket_id(@food.id,    today_basket.id)
        basketfood.quantity += 1
        basketfood.update_attributes(quantity:  basketfood.quantity)
        basketfood.save!
      else
        basketfood = BasketFood.create(basket_id: today_basket.id, food_id: @food.id)