app/controllers/goals_controller.rb

SELECT "nutrients".* FROM "nutrients" WHERE "nutrients"."id" = 9 LIMIT 1
INSERT INTO "goals" ("created_at", "limit", "nutrient_id", "target", "unit", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", Sun, 04 May 2014 17:31:08 UTC +00:00], ["limit", true], ["nutrient_id", 9], ["target", 200], ["unit", "gram"], ["updated_at", Sun, 04 May 2014 17:31:08 UTC +00:00], ["user_id", 1]]
---
  def create
    @goal = Goal.new(nutrient_id: params[:goal][:nutrient_id], user_id: current_user.id)

      unless @goal.valid?
        @errors = @goal.errors.full_messages
         flash[:notice] = "You added this nutrient already"
      else
        flash[:notice] = ""
      end


    @goal.user_id = current_user.id
    if params[:amount] == "FDA"
      @goal.target = @goal.nutrient.FDA_recommendation
      @goal.limit = @goal.nutrient.FDA_limit
      @goal.unit = @goal.nutrient.unit
    else
      @goal.target = params[:goal][:target]
      @goal.unit = @goal.nutrient.unit
        if params[:limit][:limit_id] == "minimum"
          @goal.limit = true
        else
          @goal.limit = false
        end
    end
    @goal.save

SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", "6"]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 6]]
---
  def destroy
    @goal = Goal.find(params[:id])
    @goal.destroy