app/views/goals/new.html.erb

SELECT COUNT(*) FROM "goals" WHERE "goals"."user_id" = 1
---

    <% if current_user.goals.count < 3 %>